** recording
#+BEGIN_SRC clojure
;;  (recording-start "~/Google Drive/ministrings.wav")
;; (recording-start "~/Google Drive/static-yancey-goldberg4.wav")
(recording-start "~/Google Drive/static-yancey-goldberg5.wav")
#+END_SRC

#+RESULTS:
: :recording-started

#+NAME: stop-recording
#+BEGIN_SRC clojure
  (recording-stop)
#+END_SRC

#+RESULTS: stop-recording
: /Users/a/Google Drive/static-yancey-goldberg5.wav

#+RESULTS:
: /Users/a/Google Drive/yancey-reich.wav


*** studio* at startup of overtone
#+BEGIN_SRC clojure
#atom[{:synth-group nil,
       :instruments {},
       :instrument-group #<synth-group[live]: Studio 31>,
       :master-volume 0.8, :input-gain 1,
       :bus-mixers {:in (#<synth-node[live]: overtone.studiod9b/in-bus-mixer 23>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 24>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 25>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 26>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 27>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 28>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 29>
                                     #<synth-node[live]: overtone.studiod9b/in-bus-mixer 30>),
                    :out (#<synth-node[live]: overtone.studid9b/out-bus-mixer 15>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 16>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 17>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 18>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 19>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 20>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 21>
                                      #<synth-node[live]: overtone.studid9b/out-bus-mixer 22>)},
       :recorder nil} 0x111b613c]
#+END_SRC

#+BEGIN_SRC clojure :results output
(pp-node-tree)
#+END_SRC

#+RESULTS:
#+begin_example
{:type :group,
 :id 4,
 :name "Overtone Root",
 :children
 ({:type :group, :id 31, :name "Studio", :children nil}
  {:type :group,
   :id 5,
   :name "Overtone User",
   :children
   ({:type :group,
     :id 6,
     :name "Overtone Safe Pre Default",
     :children nil}
    {:type :group, :id 7, :name "Overtone Default", :children nil}
    {:type :group,
     :id 8,
     :name "Overtone Safe Post Default",
     :children nil})})}
#+end_example

*** check loaded buffers for incarnation

[[id:19C65970-C333-4D09-AD7B-31C158D9C120][make sure buffer was loaded]] as above

#+RESULTS:

Basic playback of a loaded buffer

#+BEGIN_SRC clojure :results silent
(definst playback-buf [bufname 0] (play-buf 1 bufname))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(playback-buf yancey)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(playback-buf goldberg-slow)
#+END_SRC

#+BEGIN_SRC clojure
(buffer-info goldberg-slow)
#+END_SRC

#+RESULTS:
: #<buffer-info: 184.540590s mono 0>

#+BEGIN_SRC clojure
(buffer-info yancey)
#+END_SRC

#+RESULTS:
: #<buffer-info: 272.938163s mono 1>


*** [#B] a start (too large)

#+BEGIN_SRC clojure
  (use 'overtone.live)




  (def goldberg-slow (load-sample "/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav"))

  (def yancey (load-sample "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/all-mono/how-long-slowest-mono.wav"))


  (definst general-tgrains [buffer 0 trate 1 dur-numerator 8 amp 0.8 centerpos 0]
    (let [trate trate
          dur (/ dur-numerator trate)
          clk (impulse:ar trate)
          centerpos centerpos]
      (t-grains:ar 1 clk buffer 1 centerpos dur 0 amp 2)))


  (def cc1-1 (atom 0))
  (def cc2-1 (atom 0))
  (def cc3-1 (atom 0))
  (def cc4-1 (atom 0))
  (def cc5-1 (atom 0))
  (def cc6-1 (atom 0))
  (def cc7-1 (atom 0))
  (def cc8-1 (atom 0))
  (def cc1-2 (atom 0))
  (def cc2-2 (atom 0))
  (def cc3-2 (atom 0))
  (def cc4-2 (atom 0))
  (def cc5-2 (atom 0))
  (def cc6-2 (atom 0))
  (def cc7-2 (atom 0))
  (def cc8-2 (atom 0))

  (def pad1-1 (atom 0))
  (def pad2-1 (atom 0))
  (def pad3-1 (atom 0))
  (def pad4-1 (atom 0))
  (def pad5-1 (atom 0))
  (def pad6-1 (atom 0))
  (def pad7-1 (atom 0))
  (def pad8-1 (atom 0))
  (def pad1-2 (atom 0))
  (def pad2-2 (atom 0))
  (def pad3-2 (atom 0))
  (def pad4-2 (atom 0))
  (def pad5-2 (atom 0))
  (def pad6-2 (atom 0))
  (def pad7-2 (atom 0))
  (def pad8-2 (atom 0))

#+END_SRC

#+RESULTS:
: nil({:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x532c970a "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x5762a89f "com.sun.media.sound.MidiInDevice@5762a89f"], :version "Unknown version"} {:description "Axiom A.I.R. Mini32 HyperControl", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "HyperControl", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x43848397 "HyperControl"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x264f265d "com.sun.media.sound.MidiInDevice@264f265d"], :version "Unknown version"})#'user/goldberg-slow#'user/yancey#<instrument: general-tgrains>#'user/cc1-1#'user/cc2-1#'user/cc3-1#'user/cc4-1#'user/cc5-1#'user/cc6-1#'user/cc7-1#'user/cc8-1#'user/cc1-2#'user/cc2-2#'user/cc3-2#'user/cc4-2#'user/cc5-2#'user/cc6-2#'user/cc7-2#'user/cc8-2#'user/pad1-1#'user/pad2-1#'user/pad3-1#'user/pad4-1#'user/pad5-1#'user/pad6-1#'user/pad7-1#'user/pad8-1#'user/pad1-2#'user/pad2-2#'user/pad3-2#'user/pad4-2#'user/pad5-2#'user/pad6-2#'user/pad7-2#'user/pad8-2

#+BEGIN_SRC clojure
    (defn reset-knob [synth synth-param knob-number place midi-channel & {:keys [scale]
                                                                          :or {scale 1}}]
        (fn [{knob :note val :velocity chan :channel}]
          (if (= chan midi-channel)
            (cond (= knob knob-number)
                  (do (reset! place (* val scale))
                      (ctl synth (keyword synth-param) (deref place))
                      (println (str synth-param knob-number " : ") (deref place)))))))




    (defn swap-pad [synth synth-param pad-number place swap-fn midi-channel]
        (fn [{pad :note val :velocity chan :channel}]
          (if (= chan midi-channel)
            (cond (= pad pad-number)
                  (do (swap! place swap-fn)
                      (ctl synth (keyword synth-param) (deref place))
                      (println (str synth-param pad-number " : ") (deref place)))))))
    


    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 0 :amp 2 cc2-1 1 :scale 0.01)
              ::amp-knob2)

    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 0 :centerpos 1 cc1-1 1 :scale 0.5)
              ::centerpos-knob1)


    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :centerpos 38 pad3-1 inc 1)
              ::centerpos-pad3-inc)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :centerpos 39 pad3-1 dec 1)
              ::centerpos-pad4-dec)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :dur-numerator 36 pad1-1 inc 1)
              ::durnumerator-pad1)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :dur-numerator 37 pad1-1 dec 1)
              ::durnumerator-pad2)

  (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :trate 42 pad7-1 (fn [x] (+ 0.1 x)) 1)
              ::trate-pad7-inc)

    (on-event [:midi :note-on]
              (swap-pad general-tgrains :buffer 0 :trate 43 pad7-1 (fn [x] (- x 0.1)) 1)
              ::trate-pad8-dec)


    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 1 :amp 2 :place cc2-2 :midi-channel 2 :scale 0.01)
              ::yancey-amp-knob2)

    (on-event [:midi :control-change]
              (reset-knob general-tgrains :buffer 1 :centerpos 1 cc1-2 2 :scale 0.5)
              ::yancey-centerpos-knob1)
#+END_SRC

#+RESULTS:
: ({:description "Axiom A.I.R. Mini32 MIDI", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "MIDI", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x5386ff43 "MIDI"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x7bf18b15 "com.sun.media.sound.MidiInDevice@7bf18b15"], :version "Unknown version"} {:description "Axiom A.I.R. Mini32 HyperControl", :vendor "M-Audio", :sinks 0, :sources 2147483647, :name "HyperControl", :overtone.studio.midi/full-device-key [:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0], :info #object[com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x77743fc8 "HyperControl"], :overtone.studio.midi/dev-num 0, :device #object[com.sun.media.sound.MidiInDevice 0x68bfe7ec "com.sun.media.sound.MidiInDevice@68bfe7ec"], :version "Unknown version"})#'user/goldberg-slow#'user/yancey#<instrument: general-tgrains>#'user/cc1-1#'user/cc2-1#'user/cc3-1#'user/cc4-1#'user/cc5-1#'user/cc6-1#'user/cc7-1#'user/cc8-1#'user/cc1-2#'user/cc2-2#'user/cc3-2#'user/cc4-2#'user/cc5-2#'user/cc6-2#'user/cc7-2#'user/cc8-2#'user/pad1-1#'user/pad2-1#'user/pad3-1#'user/pad4-1#'user/pad5-1#'user/pad6-1#'user/pad7-1#'user/pad8-1#'user/pad1-2#'user/pad2-2#'user/pad3-2#'user/pad4-2#'user/pad5-2#'user/pad6-2#'user/pad7-2#'user/pad8-2#'user/reset-knob#'user/swap-pad:added-async-handler:added-async-handler:added-async-handler:added-async-handler

****** does using a future do anything helpful?

Futures block once they are dereferenced, it seems?

#+BEGIN_SRC clojure
  (def var2-future
    (future 
      (repeatedly 10 #(do (Thread/sleep 5000)
                           (swap! current-val inc)
                           (ctl var2 :centerpos @current-val)))))
#+END_SRC

#+RESULTS:
: #'user/var2-future

#+BEGIN_SRC clojure :results silent
;; need to reset current-val if previously used!
(def current-val (atom 0))

#+END_SRC

#+BEGIN_SRC clojure :results silent
@var2-future
#+END_SRC

*** general-tgrains
#+BEGIN_SRC clojure
;; if not already loaded
  (def goldberg-slow (load-sample "/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav"))


#+END_SRC

#+RESULTS:
: #'user/goldberg-slow#'user/gold

#+BEGIN_SRC clojure :results silent
;; what's in the 11th buffer?
(def gold (general-tgrains-synth goldberg-slow))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def var1 (general-tgrains-synth 0))
#+END_SRC


*** tgrains-line 
[[id:326223F4-AA19-4058-A07C-3E5F5DB9AFF5][use lines and scaling and more MIDI buttons]]

#+BEGIN_SRC clojure
(def var1-line (tgrains-line-synth :buffer goldberg-slow :mult 1))
#+END_SRC

#+RESULTS:
: #'user/var1-line

#+BEGIN_SRC clojure :results silent
(def var3-line (tgrains-line-synth :buffer 7 :mult 1))
#+END_SRC


#+BEGIN_SRC clojure :results silent
(ctl var2-line :buffer 7 :centerpos 0)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var1-line :trate 2)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var2-line :trate 1)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var1-line :duration-mult 1)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var2-line :dur-numerator 2)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def var1-noline (general-tgrains-synth :buffer 0 :centerpos 1))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl var1-noline :centerpos (line:kr 0 4 20 FREE))
#+END_SRC


*** [#B] use lines and scaling and more MIDI buttons
   :PROPERTIES:
   :ID:       704D472E-0686-45A9-9DE9-2163DB7E3E26
   :END:
#+BEGIN_SRC clojure :results silent
(def gold (general-tgrains-synth :buffer 0 :centerpos (line:kr 0.0 100 30)))
#+END_SRC


#+BEGIN_SRC clojure :results silent
  (defsynth tgrains-line-synth [buffer 0 trate 1 dur-numerator 8 amp 0.8 centerpos 0 mult 2]
    (out 0 (pan2 
            (let [track-len (buf-dur:kr buffer)
                  trate trate
                  dur (/ dur-numerator trate)
                  clk (impulse:ar trate)
                  centerpos (line:kr centerpos track-len (* mult track-len))  ]
              (t-grains:ar 1
                           clk
                           buffer
                           1
                           centerpos
                           dur
                           0
                           amp
                           2)))))
#+END_SRC


Plays almost exactly like regular track depending on the "mult"
#+BEGIN_SRC clojure
(def gold-line (tgrains-line-synth :mult 5))
#+END_SRC

#+RESULTS:
: #'user/gold-line

#+BEGIN_SRC clojure
(def yanc-line (tgrains-line-synth :buffer 1 :mult 4))
#+END_SRC

#+RESULTS:
: #'user/yanc-line


*** [#B] more complicated granular synth playack (use 't-rand')
   :PROPERTIES:
   :ID:       EB3783C6-E9EC-4838-BB28-7641CDBE1086
   :END:
#+BEGIN_SRC clojure
  (defsynth general-trand-synth
    "stochastic granular synthesis abstraction (in stereo!)"
    [buffer 0 trate 1 dur-numerator 12 amp 0.8 centerpos 0]
    (let [trate trate
          dur (/ dur-numerator trate)
          clk (impulse:kr trate)
          centerpos (+ centerpos (t-rand:kr 0 0.1 clk))]
      (out 0 (pan2 
              (t-grains:ar 1      ;; num of channels in the output?
                           clk    ;; aka 'trigger-rate'
                           buffer ;; number of buffer passed in
                           1      ;; playback "speed" of grain
                           centerpos ;;
                           dur    ;; length of grain
                           0      ;; pan
                           amp    ;; amplitude
                           2      ;; interpolation type
                           )))))
#+END_SRC

#+RESULTS:
: #<synth: general-trand-synth>

#+BEGIN_SRC clojure
(def gold-rand (general-trand-synth 0))
(def yanc-rand (general-trand-synth 1))
#+END_SRC

#+RESULTS:
: #'user/gold-rand#'user/yanc-rand

general-trand-synth2 defined below
#+BEGIN_SRC clojure
(def gold-rand (general-trand-synth2 0))
(def yanc-rand (general-trand-synth2 1))
#+END_SRC

#+RESULTS:
: #'user/gold-rand#'user/yanc-rand


*** [#B] granular synth uses t-rands + impulse throughout
   :PROPERTIES:
   :ID:       7D9FF3B8-40E3-4D15-8727-F5893524EF03
   :END:
#+BEGIN_SRC clojure
  (defsynth general-trand-synth2
    "stochastic granular synthesis abstraction (in stereo!)"
    [buffer 0 trate 1 dur-numerator 12 amp 0.8 centerpos 0]
    (let [trate trate
          dur (/ dur-numerator (+ trate (t-rand:kr 0 0.1 (impulse:kr trate))))
          clk (impulse:kr (+ trate (t-rand:kr 0 0.1 (impulse:kr trate))))
          centerpos (+ centerpos (t-rand:kr 0 0.1 clk))]
      (out 0 (pan2 
              (t-grains:ar 1      ;; num of channels in the output?
                           clk    ;; aka 'trigger-rate'
                           buffer ;; number of buffer passed in
                           1      ;; playback "speed" of grain
                           centerpos ;;
                           dur    ;; length of grain
                           0      ;; pan
                           amp    ;; amplitude
                           2      ;; interpolation type
                           )))))
#+END_SRC

#+RESULTS:
: #<synth: general-trand-synth2>


**** mouse-rand-grain1
:PROPERTIES:
:DATE_CREATED: [2017-02-11 Sat 13:23]
:ID:       6846EBE5-14EA-4655-8855-1F674FCBAB1D
:END:
Link to a gran sysnth player with randomness

#+BEGIN_SRC clojure
  (defsynth mouse-rand-grain
    [buffer 0 trate 1 dur-numerator 12 amp 0.8 centerpos 0]
    (let [trate (mouse-y:kr 0.5 20)
          dur (/ dur-numerator trate)
          clk (impulse:kr trate)
          centerpos (+ (mouse-x:kr 0 (* 0.5 (buf-dur:kr buffer))) (t-rand:kr 0 0.01 clk))]
      (out 0 (pan2 
              (t-grains:ar 1 clk buffer 1 ;; mouse x/y and t-rand
                           centerpos dur 
                           0 amp 2 )))))

#+END_SRC

#+RESULTS:
: #<synth: mouse-rand-grain>

#+BEGIN_SRC clojure 
(mouse-rand-grain 7)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/mouse-rand-grain 50>

**** [#A] interesting use of interaction and randomness (muose-rand-grain2 uses =line=)
:PROPERTIES:
:ID:       95FDE12A-8C18-42A9-8500-5619E3ACF461
:END:
Uses a mouse-x and a slowly advancing =line= to work against each
other and make the centerpos stay more or less one place.

What's the name for this kind of technique of scaling etc.? It reminds
me of Ivan of Teixera--error correction doesn't quite do it.

The idea is "smoothing," reducing out jumps of values that are the
result of unnecessarily noisy readings?

#+NAME: mouse-rand-grain2-def
#+BEGIN_SRC clojure :results silent
(defsynth mouse-rand-grain2
  [buffer 0 trate 1 dur-numerator 12 amp 0.8 centerpos 0]
  (let [trate (mouse-y:kr 0.5 20)
        track-len (buf-dur:kr buffer)
        dur (/ dur-numerator trate)
        clk (impulse:kr trate)
        line-centerpos (+ (mouse-x:kr 0 (buf-dur:kr buffer))
                          (line:kr 0 (* 0.5 track-len) (* 2 track-len))
                          (t-rand:kr 0 0.01 clk))]
    (out 0 (pan2 
            (t-grains:ar 1 clk buffer ;; mouse x/y and line and rand
                         1 line-centerpos dur 0 amp 2 )))))

#+END_SRC         

#+RESULTS:
: #<synth: mouse-rand-grain2>

         
#+BEGIN_SRC clojure 
(def pasdaction-gran (mouse-rand-grain2 7))
#+END_SRC

#+RESULTS:
: #'user/pasdaction-gran
**** [#A] granular with g-verb
    :PROPERTIES:
    :ID:       8E237C21-866C-4BD8-8681-4AB843BDFA1C
    :END:

#+NAME: mouse-rand-grain3-def
#+BEGIN_SRC clojure :results silent
    (defsynth mouse-rand-grain3
  "Summary of arglist: buffer; trate; amp; centerpos; AND then reverb args...
  roomsize; revtime; damping; inputbw; drylevel; earlyreflevel; taillevel; maxroomsize"
      [buffer 0 trate 1
       dur-numerator 12 amp 0.8
       centerpos 0 roomsize 10
       revtime 5 damping 0.5
       inputbw 0.2 drylevel 0.1
       earlyreflevel 0.7 taillevel 0.5
       maxroomsize 300]
      (let [trate (mouse-y:kr 0.5 20)
            track-len (buf-dur:kr buffer)
            dur (/ dur-numerator trate)
            clk (impulse:kr trate)
            line-centerpos (+ (mouse-x:kr 0 (buf-dur:kr buffer))
                              (line:kr 0 (* 0.5 track-len) (* 2 track-len))
                              (t-rand:kr 0 0.01 clk))]
        (out 0 (pan2 (g-verb  
                (t-grains:ar 1 clk buffer 1 ;; mouse x, line, rand, reverb
                             line-centerpos dur 
                             0 amp 2 ) )))))
#+END_SRC

#+BEGIN_SRC clojure :results output
(def pasdaction-grand (mouse-rand-grain3 :buffer 7 :amp 0.1))
#+END_SRC

#+RESULTS:
: Sending:  /s_new [user/mouse-rand-grain3 42 1 7 roomsize 10.0 earlyreflevel 0.7 taillevel 0.5 dur-numerator 12.0 buffer 7.0 maxroomsize 300.0 trate 1.0 amp 0.1 revtime 5.0 centerpos 0.0 inputbw 0.2 damping 0.5 drylevel 0.1]

#+BEGIN_SRC clojure :results silent
(def apotheose-grand (mouse-rand-grain3 :buffer 3 :amp 0.1))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(def coda-grand (mouse-rand-grain3 :buffer 4 :amp 0.1))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl mouse-rand-grain3 :amp 0.1)
#+END_SRC

#+BEGIN_SRC clojure :results silent
(ctl mouse-rand-grain3 : 0.1)
#+END_SRC
** print out mouse x and y values 
:PROPERTIES:
:DATE_CREATED: [2017-02-11 Sat 09:33]
:END:

Won't print out to REPL from a babel-block, hmm?
#+BEGIN_SRC clojure 
(let [t 2] (do (run 30 (poll:kr (impulse:kr t) (mouse-y) "mouse-y:"))
               (run 30 (poll:kr (impulse:kr t) (mouse-x) "mouse-x:" ))
               (run 30 (poll:kr (impulse:kr t) (+ 0.0) (str " " \newline \newline)))))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 108>

** [#A] some ugen tests
   :PROPERTIES:
   :DATE_CREATED: [2017-02-28 Tue 16:00]
   :END:

#+BEGIN_SRC clojure :results silent
(demo (pan2 (sin-osc)))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 1 (pan2 (* 10 (rlpf (saw) (line 20 6e3 0.5) 1))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 0.75 (pan2 (* 30 (comb-n (bpf (pink-noise) (line 20 6e3 0.5) 1) 0.4 0.3 0.5))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 400 (bpf (pink-noise) 1000 0.01))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 10.1 (klang [[1000 440 260]]))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 10 (pan2 (* 10 (+ (* 40 (bpf (pink-noise) 1000 0.01))
                         (klang [(choose-n 4 (map #(+ % 200) (range 1 100)))])))))
#+END_SRC

#+BEGIN_SRC clojure :results value
(rand-nth (map #(* % 10) (range 1 100)))
#+END_SRC

#+RESULTS:
: 850

#+BEGIN_SRC clojure :results silent
(demo 10 (pan2 (* 2 (+ (* 40 (bpf (pink-noise) (scale-range (rand) 0 1 500 1000) 0.01))
                         (klang [(choose-n 10 (map #(+ % 400) (range
                                                               1 ;;10
                                                               100 ;;1000
                                                               )))])))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 10 (pan2 (* 40 (comb-n (bpf (pink-noise) (line 20 6e3 10) 1) 0.9 0.3 0.5))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 20  (comb-n (bpf (saw (+ 100 (lf-noise0:kr))) (line 20 6e3 10) 1) 0.9 0.3 0.5))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(demo 5 (pan2 (* 2.5  (saw (+ 400 (* 100 (lf-pulse:kr 10)))))))
#+END_SRC

#+BEGIN_SRC clojure :results silent
(stop)
#+END_SRC
